


  var str = prompt('Введите ваше имя')
  var imya = 'Шах-Ислам' 


  console.log('Меня зовут) ' + imya);
  var str = prompt('Сколько вам лет?')


  var age = '23'
  console.log('мне ' + age);


 var str = +prompt('Пример 1)  77 + 11 =?')
 console.log('Пример 1) '  + '77 + 11 = ' + (77 + 11) + " ваш ответ " + str);  


  var str = +prompt('Пример 2)  888 - 122 =?')
  console.log('Пример 2) ' + '888 - 122 = ' + (888 - 122) + " ваш ответ " + str);
 


  var str = +prompt('Пример 3)  999 / 333 =?')
  console.log('Пример 3) ' + '999 / 333 = ' + 999 / 333 + " ваш ответ " + str );
 


  var str = +prompt('Пример 4)  111 * 44 =?')
  console.log('Пример 4) ' + '111 * 44 = ' + 999 * 333 + " ваш ответ " + str );
 


  var str = +prompt('Пример 5)  100500 % 22 =?')
  console.log('Пример 5) ' + '100500 % 22 = ' + 100500 % 22 + " ваш ответ " + str );
 

 var str = prompt('откройте консоль для просмотра')


var x = +prompt('Введите первое число')
    y = +prompt('Введите второе число')
    z = +prompt('Введите третье число')
alert('среднее арифметическое число ' + (x + y + z) / 3)










